//=======================================================
// HTML5 FUN 題庫設定檔 PK (三欄式題庫)
//=======================================================

//基本設定
//------------------------------
//共有幾個選項
//------------------------------
optionsTotal = 4;		

//------------------------------
//一列有幾個選項(pk, 王牌投手用)
//------------------------------
optionColTotal = 4;		

//------------------------------
//開始比賽前,說明對話框的說明文字
//------------------------------
helpText = "請找出空格較合適的語詞。大家都按GO以後開始PK";


//---------------------------------------------------
// [題庫]
//---------------------------------------------------

//------------------------------
//欄位分隔符號為兩個井字號(##)
//------------------------------
seperator = '##';

//------------------------------
//多個選項的分隔符號
//------------------------------
seperator2 = '~~';

//
//[題目設定]
//  一行一題, 
//  三欄式題庫，每一題以欄位分隔符號(##)分隔為三欄
//    [例] 題幹##正確選項##錯誤選項
//
//  正確選項及錯誤選項可再利用選項分隔符號(~~)分隔多個
//    [例] 題幹##正確1~~正確2##錯誤1~~錯誤2~~錯誤3
//
//
question_lines = function(){/*--這一行請勿更改--

數線上有A(1)、B(7)兩點，則A、B兩點間的距離為多少？##6 ##－6~~8~~－8

數線上有A(48)、B(28)兩點，則A、B兩點間的距離為多少？##20 ##－20~~－76~~76

數線上有C(4)、D(－12)兩點，則C、D兩點間的距離為多少？##16 ##－16~~8~~－8

數線上有C(14)、D(－16)兩點，則C、D兩點間的距離為多少？##30 ##－30~~2~~－2

數線上有E(－4)、F(－9)兩點，則E、F兩點間的距離為多少？##5 ## －13~~13~~－5

數線上有E(－9)、F(－16)兩點，則E、F兩點間的距離為多少？##7 ## －25~~25~~－7

數線上有A(a)、B(3)兩點，如果AB的長度等於2，則a可能是多少？##5或1## 5或－1~~5~~－1

數線上有C(3)、D(d)兩點，如果CD的長度等於11，則d可能是多少？##14或－8## 14或8~~14~~－8

數線上有E(e)、F(－3)兩點，如果EF的長度等於2，則e可能是多少？##－1或－5##5或－1~~－5~~－1

數線上有E(e)、F(－15)兩點，如果EF的長度等於15，則e可能是多少？##0或－30##0或30~~0~~－30


-----*/}.toString().replace(/\r/g,"").slice("function(){/*--這一行請勿更改--".length+1,-9);



/******************************************************************
 以下為程式碼, 不要更動
 ******************************************************************/
getOneQuestion = function(tools) {
	return tools.getOneQuestion(question_lines, [seperator, seperator2]);
};

